'''-----------------------------------------перевірка слова на поліндром--------------------'''

def rev_str(my_str):      # генератор, який перевертає слово.
    length = len(my_str)      # визначаємо довжину слова
    for i in range(length - 1, -1, -1):  # читаємо слово навпаки'''-------------er'''
        yield my_str[i]

word=input('Введіть слово для перевірки на поліндром: ')
rev_word=''
for char in rev_str(word):     # складаємо по буквам перевернуте слово
    rev_word=rev_word+char
print(rev_word)
if word==rev_word:      # перевірка чи слово є поліндромом
    print('Так, це слово є поліндромом')
else:
    print('Ні, це слово не є поліндромом')